README.org
#+SETUPFILE: setup/theme-readtheorg-local.setup
#+STARTUP: showall

* Intro

本篇文档是由近期给公司校招的新人（没有Python背景）准备的培训资料整理而来，学习计
划以学员的自学为主。根据实践平均每周学员需要花费1-2天的时间，每周再加上一个小时
跟踪和讲解相关内容。

教程并不是单纯的Python语言培训，侧重点在于让新人快速参与项目开发。

* Python学习计划
** 受众
   假定学员熟悉基本的编程概念，使用过Java/C/C++其中一门语言，有一定项目开发经验
** 目标
   预计为期8周的阅读及学习计划，以完成每周设定的任务的方式引导学习Python语言以及
   相关开发知识，帮助学员进行Python项目开发

   需要完成的任务包括：
   - 完成参考资料的阅读（扩展阅读不作要求）
   - 完成一些具体的编程练习
   - 阅读一些库的文档并编写例子初步掌握使用
** 进度反馈及跟踪
   每周会有例会跟踪进度，平时的反馈我们可以通过邮件交流

   randall.wjz@gmail.com

* 第1周 Intro
** 本周目标
   在开始学习Python语言的具体知识细节前了解一些背景知识，以及设置一个Python开发环境
** 请完成以下材料的阅读
*** 背景知识了解
**** 简单的Python历史介绍
     [[https://www.15yan.com/story/1JKTBQvVk5e/][人生苦短，我用Python]]
**** Python语言的设计哲学
     - [[https://www.python.org/dev/peps/pep-0020/][The Zen of Python]]
     - [[https://wiki.python.org/moin/PythonZenChineseTranslate][中文翻译参考]]
     #+BEGIN_EXAMPLE
     The Zen of Python, by Tim Peters

     Beautiful is better than ugly.
     Explicit is better than implicit.
     Simple is better than complex.
     Complex is better than complicated.
     Flat is better than nested.
     Sparse is better than dense.
     Readability counts.
     Special cases aren't special enough to break the rules.
     Although practicality beats purity.
     Errors should never pass silently.
     Unless explicitly silenced.
     In the face of ambiguity, refuse the temptation to guess.
     There should be one-- and preferably only one --obvious way to do it.
     Although that way may not be obvious at first unless you're Dutch.
     Now is better than never.
     Although never is often better than right now.
     If the implementation is hard to explain, it's a bad idea.
     If the implementation is easy to explain, it may be a good idea.
     Namespaces are one honking great idea -- let's do more of those!
     #+END_EXAMPLE
**** Python社区
     - [[https://pythonguidecn.readthedocs.io/zh/latest/intro/community.html][社区]]
     - PEP，中文翻译为Python增强提议。这个词经常在Python学习过程中看到，了解什么是PEP
     - PSF，Python Software Foundation, Python软件基金会
     - PyCon, 每年社区举办的Python开发者大会，youtube上可以找到与会演讲视频
**** 了解Python2和Python3的现状
     - [[https://wiki.python.org/moin/Python2orPython3][Should I use Python 2 or Python 3 for my development activity?]]
     - Python2版本将于2020年正式停止更新维护，Python语言的未来以及最新改进在Python3版本上进行
     - 新项目应该默认使用Python3进行开发
     - 现存的大量项目以及第三库使用Python2版本，流行的Python库大多兼容Python2/3版本
     - 目前公司的项目使用Python2版本
*** 编程环境设置
**** 选择Python解释器
     [[https://python-guide-pt-br.readthedocs.io/en/latest/starting/which-python/][Picking an Interpreter]]
**** 安装Python
     [[https://python-guide-pt-br.readthedocs.io/en/latest/starting/installation/][Properly Installing Python]]
**** 了解pip
     Python的包管理工具，类比Java语言的Maven工具
     - [[https://xin053.github.io/2016/07/02/pip%E5%8C%85%E7%AE%A1%E7%90%86%E5%99%A8%E4%BD%BF%E7%94%A8%E8%AF%A6%E8%A7%A3/][pip包管理器使用详解]]
     - [[https://pip-cn.readthedocs.io/en/latest/quickstart.html][文档]]
**** IDE & Editor
     项目组使用PyCharm进行Python开发，请下载安装并熟悉使用
     - [[http://www.jianshu.com/p/259fdc97bfe2][介绍]]
     - [[https://www.jetbrains.com/pycharm/][官网]]

     前端项目使用VS Code作为开发环境
     - [[https://jeasonstudio.gitbooks.io/vscode-cn-doc/content/md/%E7%BC%96%E8%BE%91%E5%99%A8/%E4%B8%BA%E4%BB%80%E4%B9%88%E9%80%89%E7%94%A8VSCode.html][Why Visual Studio Code? - 为什么选用VSCode]]
     - [[https://code.visualstudio.com/][官网]]

* 编程练习
  - 在本地安装设置好Python2.7开发环境
  - 使用pip安装requests库，[[http://docs.python-requests.org/en/master/user/install/][参考资料]]
  - 安装并设置好PyCharm
  - 使用PyCharm建立项目，编写程序使用requests使用GET请求访问 http://www.bing.com 并输出内容，[[http://docs.python-requests.org/en/master/user/quickstart/#make-a-request][参考资料]]

** 扩展阅读
   - [[http://py3readiness.org/][Python流行的第三方库支持Python3的情况]]
   - 前端项目使用[[https://standardjs.com/readme-zhcn.html][JavaScript Standard Style]] 作为代码风格标准
   - [[https://pythonclock.org/][pythonclock]]

* 第2周 开始Python学习
** 本周目标
   本周将进行为期三周的Python语言学习，每周将指定的一些练习题目，请尝试完成（来源于Python Koan项目）。

   阅读材料中将列出一些参考的Python学习教程，学员会有比较充足的时间进行自由的学习。
