README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-09-02 Sat 00:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="王建智" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga5bf1d2">1. Intro</a></li>
<li><a href="#orged8b618">2. Python学习计划</a>
<ul>
<li><a href="#org021de72">2.1. 受众</a></li>
<li><a href="#orgf84f8d7">2.2. 目标</a></li>
<li><a href="#orgba9229f">2.3. 进度反馈及跟踪</a></li>
</ul>
</li>
<li><a href="#org97d50ee">3. 第1周 Intro</a>
<ul>
<li><a href="#org6c06270">3.1. 本周目标</a></li>
<li><a href="#org0a4766b">3.2. 请完成以下材料的阅读</a>
<ul>
<li><a href="#orgfacb8f1">3.2.1. 背景知识了解</a></li>
<li><a href="#org328ad02">3.2.2. 编程环境设置</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgfecb1ef">4. 编程练习</a>
<ul>
<li><a href="#org69f8a11">4.1. 扩展阅读</a></li>
</ul>
</li>
<li><a href="#org5e0619d">5. 第2周 开始Python学习</a>
<ul>
<li><a href="#orgb9cf96b">5.1. 本周目标</a></li>
<li><a href="#orgd43a90e">5.2. Python Koan项目</a></li>
<li><a href="#org3308d35">5.3. 阅读材料</a>
<ul>
<li><a href="#orga919551">5.3.1. 快速入门</a></li>
<li><a href="#orgbe39e29">5.3.2. 请完成以下教程</a></li>
</ul>
</li>
<li><a href="#orgcf7adcf">5.4. 编程练习 | 本周的Python Koan题目</a></li>
</ul>
</li>
<li><a href="#orgf73e5e4">6. 第3周 继续Python Koan题目</a>
<ul>
<li><a href="#orgb144352">6.1. 本周目标</a></li>
<li><a href="#org51c2403">6.2. 阅读材料</a>
<ul>
<li><a href="#org0af1934">6.2.1. 请完成以下教程</a></li>
</ul>
</li>
<li><a href="#org79eab5e">6.3. 编程练习 | 本周的Python Koan题目</a></li>
</ul>
</li>
<li><a href="#orgbb4f712">7. 第4周 decorator and context manager</a>
<ul>
<li><a href="#org2dcb878">7.1. 本周目标</a></li>
<li><a href="#orgede095c">7.2. 阅读材料</a></li>
<li><a href="#org89762a5">7.3. 编程练习 | 本周的Python Koan题目</a></li>
<li><a href="#org1310e3f">7.4. 扩展阅读</a></li>
<li><a href="#org5fe7d92">7.5. 参考书目</a></li>
</ul>
</li>
<li><a href="#org5d7a0f1">8. 第5周 编程风格与命令行开发</a>
<ul>
<li><a href="#org05f81f3">8.1. 本周目标</a></li>
<li><a href="#org4695bd4">8.2. 阅读材料</a>
<ul>
<li><a href="#org1d858c6">8.2.1. ipython</a></li>
<li><a href="#orge84cb2e">8.2.2. pdb</a></li>
<li><a href="#org3da700b">8.2.3. vim</a></li>
</ul>
</li>
<li><a href="#org324c1d0">8.3. 编程练习</a></li>
<li><a href="#org40aa092">8.4. 扩展阅读</a>
<ul>
<li><a href="#org17cbe29">8.4.1. windows开发环境</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3833a1a">9. 第6周 标准库及其它</a>
<ul>
<li><a href="#orge2ad086">9.1. 本周目标</a></li>
<li><a href="#orgf0cc333">9.2. 阅读材料</a>
<ul>
<li><a href="#org2fed6cd">9.2.1. 标准库</a></li>
<li><a href="#org3713540">9.2.2. 常用库</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org21851fa">10. 第7周 开源工具</a>
<ul>
<li><a href="#orgc9d2fa5">10.1. 本周目标</a></li>
<li><a href="#org38586fa">10.2. 阅读材料</a>
<ul>
<li><a href="#org0eb43e1">10.2.1. Markdown</a></li>
<li><a href="#orge14818c">10.2.2. Git &amp;&amp; Gerrit</a></li>
<li><a href="#org80a3a06">10.2.3. Jenkins &amp;&amp; CI</a></li>
<li><a href="#org93c4449">10.2.4. tox</a></li>
<li><a href="#orgb193356">10.2.5. 运维利器 Ansible</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb2bffff">11. 第8周 实战</a>
<ul>
<li><a href="#org26d2c1f">11.1. 本周目标</a></li>
<li><a href="#org03f7f6a">11.2. 编程练习</a>
<ul>
<li><a href="#orge28090b">11.2.1. 申请虚拟机作为开发机，要求CentOS7.2系统</a></li>
<li><a href="#org3b1012b">11.2.2. 配置pip文件</a></li>
<li><a href="#org45e6d7f">11.2.3. 安装并配置PostgreSQL数据库</a></li>
<li><a href="#orgeb2af3d">11.2.4. 创建一个Python项目</a></li>
<li><a href="#org78b2b8b">11.2.5. 编程</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga5bf1d2" class="outline-2">
<h2 id="orga5bf1d2"><span class="section-number-2">1</span> Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
本篇文档是由近期给公司校招的新人（没有Python背景）准备的培训资料整理而来，学习计
划以学员的自学为主。根据实践平均每周学员需要花费1-2天的时间，每周再加上一个小时
跟踪和讲解相关内容。
</p>

<p>
教程并不是单纯的Python语言培训，侧重点在于让新人快速参与项目开发。
</p>
</div>
</div>

<div id="outline-container-orged8b618" class="outline-2">
<h2 id="orged8b618"><span class="section-number-2">2</span> Python学习计划</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org021de72" class="outline-3">
<h3 id="org021de72"><span class="section-number-3">2.1</span> 受众</h3>
<div class="outline-text-3" id="text-2-1">
<p>
假定学员熟悉基本的编程概念，使用过Java/C/C++其中一门语言，有一定项目开发经验
</p>
</div>
</div>
<div id="outline-container-orgf84f8d7" class="outline-3">
<h3 id="orgf84f8d7"><span class="section-number-3">2.2</span> 目标</h3>
<div class="outline-text-3" id="text-2-2">
<p>
预计为期8周的阅读及学习计划，以完成每周设定的任务的方式引导学习Python语言以及
相关开发知识，帮助学员进行Python项目开发
</p>

<p>
需要完成的任务包括：
</p>
<ul class="org-ul">
<li>完成参考资料的阅读（扩展阅读不作要求）</li>
<li>完成一些具体的编程练习</li>
<li>阅读一些库的文档并编写例子初步掌握使用</li>
</ul>
</div>
</div>
<div id="outline-container-orgba9229f" class="outline-3">
<h3 id="orgba9229f"><span class="section-number-3">2.3</span> 进度反馈及跟踪</h3>
<div class="outline-text-3" id="text-2-3">
<p>
每周会有例会跟踪进度，平时的反馈我们可以通过邮件交流
</p>

<p>
randall.wjz@gmail.com
</p>
</div>
</div>
</div>

<div id="outline-container-org97d50ee" class="outline-2">
<h2 id="org97d50ee"><span class="section-number-2">3</span> 第1周 Intro</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org6c06270" class="outline-3">
<h3 id="org6c06270"><span class="section-number-3">3.1</span> 本周目标</h3>
<div class="outline-text-3" id="text-3-1">
<p>
在开始学习Python语言的具体知识细节前了解一些背景知识，以及设置一个Python开发环境
</p>
</div>
</div>
<div id="outline-container-org0a4766b" class="outline-3">
<h3 id="org0a4766b"><span class="section-number-3">3.2</span> 请完成以下材料的阅读</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-orgfacb8f1" class="outline-4">
<h4 id="orgfacb8f1"><span class="section-number-4">3.2.1</span> 背景知识了解</h4>
<div class="outline-text-4" id="text-3-2-1">
</div><ol class="org-ol"><li><a id="orgb184760"></a>简单的Python历史介绍<br /><div class="outline-text-5" id="text-3-2-1-1">
<p>
<a href="https://www.15yan.com/story/1JKTBQvVk5e/">人生苦短，我用Python</a>
</p>
</div></li>
<li><a id="org960cad3"></a>Python语言的设计哲学<br /><div class="outline-text-5" id="text-3-2-1-2">
<ul class="org-ul">
<li><a href="https://www.python.org/dev/peps/pep-0020/">The Zen of Python</a></li>
<li><a href="https://wiki.python.org/moin/PythonZenChineseTranslate">中文翻译参考</a></li>
</ul>
<pre class="example">
The Zen of Python, by Tim Peters

Beautiful is better than ugly.
Explicit is better than implicit.
Simple is better than complex.
Complex is better than complicated.
Flat is better than nested.
Sparse is better than dense.
Readability counts.
Special cases aren't special enough to break the rules.
Although practicality beats purity.
Errors should never pass silently.
Unless explicitly silenced.
In the face of ambiguity, refuse the temptation to guess.
There should be one-- and preferably only one --obvious way to do it.
Although that way may not be obvious at first unless you're Dutch.
Now is better than never.
Although never is often better than right now.
If the implementation is hard to explain, it's a bad idea.
If the implementation is easy to explain, it may be a good idea.
Namespaces are one honking great idea -- let's do more of those!
</pre>
</div></li>
<li><a id="orgb6155b6"></a>Python社区<br /><div class="outline-text-5" id="text-3-2-1-3">
<ul class="org-ul">
<li><a href="https://pythonguidecn.readthedocs.io/zh/latest/intro/community.html">社区</a></li>
<li>PEP，中文翻译为Python增强提议。这个词经常在Python学习过程中看到，了解什么是PEP</li>
<li>PSF，Python Software Foundation, Python软件基金会</li>
<li>PyCon, 每年社区举办的Python开发者大会，youtube上可以找到与会演讲视频</li>
</ul>
</div></li>
<li><a id="org3d40c73"></a>了解Python2和Python3的现状<br /><div class="outline-text-5" id="text-3-2-1-4">
<ul class="org-ul">
<li><a href="https://wiki.python.org/moin/Python2orPython3">Should I use Python 2 or Python 3 for my development activity?</a></li>
<li>Python2版本将于2020年正式停止更新维护，Python语言的未来以及最新改进在Python3版本上进行</li>
<li>新项目应该默认使用Python3进行开发</li>
<li>现存的大量项目以及第三库使用Python2版本，流行的Python库大多兼容Python2/3版本</li>
<li>目前公司的项目使用Python2版本</li>
</ul>
</div></li></ol>
</div>
<div id="outline-container-org328ad02" class="outline-4">
<h4 id="org328ad02"><span class="section-number-4">3.2.2</span> 编程环境设置</h4>
<div class="outline-text-4" id="text-3-2-2">
</div><ol class="org-ol"><li><a id="orgc9f46a4"></a>选择Python解释器<br /><div class="outline-text-5" id="text-3-2-2-1">
<p>
<a href="https://python-guide-pt-br.readthedocs.io/en/latest/starting/which-python/">Picking an Interpreter</a>
</p>
</div></li>
<li><a id="org47fa125"></a>安装Python<br /><div class="outline-text-5" id="text-3-2-2-2">
<p>
<a href="https://python-guide-pt-br.readthedocs.io/en/latest/starting/installation/">Properly Installing Python</a>
</p>
</div></li>
<li><a id="org136de16"></a>了解pip<br /><div class="outline-text-5" id="text-3-2-2-3">
<p>
Python的包管理工具，类比Java语言的Maven工具
</p>
<ul class="org-ul">
<li><a href="https://xin053.github.io/2016/07/02/pip%E5%8C%85%E7%AE%A1%E7%90%86%E5%99%A8%E4%BD%BF%E7%94%A8%E8%AF%A6%E8%A7%A3/">pip包管理器使用详解</a></li>
<li><a href="https://pip-cn.readthedocs.io/en/latest/quickstart.html">文档</a></li>
</ul>
</div></li>
<li><a id="org1c392e1"></a>IDE &amp; Editor<br /><div class="outline-text-5" id="text-3-2-2-4">
<p>
项目组使用PyCharm进行Python开发，请下载安装并熟悉使用
</p>
<ul class="org-ul">
<li><a href="http://www.jianshu.com/p/259fdc97bfe2">介绍</a></li>
<li><a href="https://www.jetbrains.com/pycharm/">官网</a></li>
</ul>

<p>
前端项目使用VS Code作为开发环境
</p>
<ul class="org-ul">
<li><a href="https://jeasonstudio.gitbooks.io/vscode-cn-doc/content/md/%E7%BC%96%E8%BE%91%E5%99%A8/%E4%B8%BA%E4%BB%80%E4%B9%88%E9%80%89%E7%94%A8VSCode.html">Why Visual Studio Code? - 为什么选用VSCode</a></li>
<li><a href="https://code.visualstudio.com/">官网</a></li>
</ul>
</div></li></ol>
</div>
</div>
</div>

<div id="outline-container-orgfecb1ef" class="outline-2">
<h2 id="orgfecb1ef"><span class="section-number-2">4</span> 编程练习</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>在本地安装设置好Python2.7开发环境</li>
<li>使用pip安装requests库，<a href="http://docs.python-requests.org/en/master/user/install/">参考资料</a></li>
<li>安装并设置好PyCharm</li>
<li>使用PyCharm建立项目，编写程序使用requests使用GET请求访问 <a href="http://www.bing.com">http://www.bing.com</a> 并输出内容，<a href="http://docs.python-requests.org/en/master/user/quickstart/#make-a-request">参考资料</a></li>
</ul>
</div>

<div id="outline-container-org69f8a11" class="outline-3">
<h3 id="org69f8a11"><span class="section-number-3">4.1</span> 扩展阅读</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><a href="http://py3readiness.org/">Python流行的第三方库支持Python3的情况</a></li>
<li>前端项目使用<a href="https://standardjs.com/readme-zhcn.html">JavaScript Standard Style</a> 作为代码风格标准</li>
<li><a href="https://pythonclock.org/">pythonclock</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5e0619d" class="outline-2">
<h2 id="org5e0619d"><span class="section-number-2">5</span> 第2周 开始Python学习</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgb9cf96b" class="outline-3">
<h3 id="orgb9cf96b"><span class="section-number-3">5.1</span> 本周目标</h3>
<div class="outline-text-3" id="text-5-1">
<p>
本周将进行为期三周的Python语言学习，每周将指定的一些练习题目，请尝试完成（来源于Python Koan项目）。
</p>

<p>
阅读材料中将列出一些参考的Python学习教程，学员会有比较充足的时间进行自由的学习。
</p>
</div>
</div>
