README.org
** Python Koan项目
   Python Koan是通过TDD进行Python学习的一个项目，[[https://github.com/gregmalcolm/python_koans][项目地址]]
   请下载并按照文档设置，注意我们使用python2文件夹下的代码

   每个题目都关于Python语言的一个特性，完成题目可以帮助掌握这个特性。
   如遇到题目涉及到的教程中没有提及的概念，可以跳过。
   [[https://github.com/sourabhv/python-koans-solutions/tree/master/python3/koans][Python Koan 答案参考]] （注意此答案使用Python3版本）

** 阅读材料
*** 快速入门
   - [[https://stephensugden.com/crash_into_python/][写给有经验程序员的Python入门教程]] 快速了解Python特性
   - [[https://dzone.com/refcardz/core-python][Python 核心特性]] Section 1-11
*** 请完成以下教程
   - [[https://pymbook.readthedocs.io/en/py2/][Welcome to Python for you and me]]  （比较简洁，PEP8 Guidelines，Virtualenv及之后章节可跳过)

** 编程练习 | 本周的Python Koan题目
   - about_asserts.py
   - about_strings.py
   - about_none.py
   - about_lists.py
   - about_list_assignments.py
   - about_dictionaries.py
   - about_string_manipulation.py
   - about_tuples.py
   - about_methods.py
   - about_control_statements.py
   - about_true_and_false.py
   - about_sets.py

* 第3周 继续Python Koan题目
** 本周目标
** 阅读材料
*** 请完成以下教程
   - [[https://docs.python.org/2.7/tutorial/index.html][Python官方入门教程]] (阅读2-9章节即可)

** 编程练习 | 本周的Python Koan题目
   - about_triangle_project.py
   - about_exceptions.py
   - about_triangle_project2.py
   - about_iteration.py
   - about_comprehension.py
   - about_generators.py
   - about_lambdas.py
   - about_scoring_project.py
   - about_classes.py
   - about_new_style_classes.py
   - about_with_statements.py
   - about_monkey_patching.py
   - about_dice_project.py
   - about_method_bindings.py

* 第4周 decorator and context manager
** 本周目标
   相信大家对编程语言中的基于数据和基于函数的抽象都不陌生，现在来看一下Python对于基于语法的抽象的支持。
   - 了解Python中装饰器(decorator)的概念
   - 了解Python中上下文管理器(context manager)的概念

** 阅读材料
   - [[https://www.cnblogs.com/vamei/archive/2013/02/16/2820212.html][装饰器]] 简短介绍
   - [[https://www.thecodeship.com/patterns/guide-to-python-function-decorators/][A guide to Python's function decorators]]
   - [[https://www.cnblogs.com/vamei/archive/2012/11/23/2772445.html][上下文管理器]] 简短介绍
   - [[http://arnavk.com/posts/python-context-managers/][Python in the real world: Context Managers]]

** 编程练习 | 本周的Python Koan题目
   - about_decorating_with_functions.py
   - about_decorating_with_classes.py
   - about_inheritance.py
   - about_multiple_inheritance.py
   - about_scope.py
   - about_modules.py
   - about_packages.py
   - about_class_attributes.py
   - about_attribute_access.py
   - about_deleting_objects.py
   - about_proxy_object_project.py
   - about_proxy_object_project.py
   - about_extra_credit.py
   - about_regex.py

** 扩展阅读
   - [[https://pymotw.com/2/contextlib/][标准库中的context manager工具]]

** 参考书目
   学习了两个教程之后对Python语言已经有大致的了解，接下来如果需要深入学习，建议找一些严肃的书籍进行系统性的学习。
   - [[http://fwww.pythonbooks.org][python books]]
   - [[https://pythonguidecn.readthedocs.io/zh/latest/intro/learning.html][学习Python]]资源
   - [[https://www.fullstackpython.com/best-python-resources.html][Best Python Resources]] Full Stack Python 本身也是很好的学习资源

* 第5周 编程风格与命令行开发
** 本周目标
   了解Python编程风格及命令行开发工具.

   Python code style 业界现在有两个标准，PEP8 以及 [[https://google.github.io/styleguide/pyguide.html][Google Python Style Guide]]
   项目组采用PEP8标准，对于Google Style可以稍作了解

   除了日常在IDE里进行Python开发，开发人员也应该掌握一些在命令行环境下进行编程和debug的技能
** 阅读材料
   - [[https://pythonguidecn.readthedocs.io/zh/latest/writing/style.html][代码风格]] [[http://docs.python-guide.org/en/latest/writing/style/][英文版]]
   - [[https://pythonguidecn.readthedocs.io/zh/latest/dev/virtualenvs.html][虚拟环境]] virtualenv
   - [[https://pythonguidecn.readthedocs.io/zh/latest/dev/pip-virtualenv.html][Pip和Virtualenv的更多配置]]
   - [[http://pep8.org/][PEP8]] 建议阅读这个美化过的排版，[[https://www.python.org/dev/peps/pep-0008/][原版]]地址
   - [[https://github.com/google/yapf][yapf]] Google 出品的自动化格式代码工具，建议了解一下
*** ipython
    - [[https://ipython.org/][官网]]
    - 作为一个交互式shell, 用来代替默认的python命令行编程环境
      #+BEGIN_SRC shell
      # 使用以下命令安装python2.7版本的ipython
      pip install 'ipython<=6.0.0'
      #+END_SRC
*** pdb
    Python debuger, 交互式debug环境。类似于GDB
    - [[https://pymotw.com/2/pdb/index.html][使用教程]]
*** vim
   命令行环境下的编辑器
   - [[http://www.openvim.com/][交互式的VIM简短教程]] 十分炫酷的简短教程，掌握日常用到的最基本操作

** 编程练习
   本周没有具体的编程练习，请花一点时间熟悉一下pip/virtualenv/ipython/pdb/vim工具。

   编辑器/IDE是非常重要的工具，在工作过程中几乎所有的开发时间都花这上面，所以不
   论你喜欢vim/emacs/vs code/atom/sublime text，你应该熟悉你的编程器/IDE。花些时间去了解
   你喜欢的编程器/IDE

   适当设置好开发环境对于提高开发效率也相当重要，有兴趣可以了解一下扩展阅读里列出的工具

** 扩展阅读
   - [[https://pythonguidecn.readthedocs.io/zh/latest/dev/env.html][你的开发环境]] [[http://docs.python-guide.org/en/latest/dev/env/][英文版]]
   - [[https://aaaaaashu.gitbooks.io/mac-dev-setup/content/index.html][Mac 开发配置手册]]
*** windows开发环境
    个人推荐 Cygwin + ConEmu + zsh + oh-my-shell + CoreUtils
    - [[https://cygwin.com/install.html][Cygwin]]
    - [[https://conemu.github.io/][ConEmu]]
    - [[http://www.jeffjade.com/2015/07/29/2015-07-29-mac-musthave-software/][终极Shell]] 在Cygwin环境中也可以使用zsh + oh-my-zsh
    - [[http://gnuwin32.sourceforge.net/packages/coreutils.htm][CoreUtils for Windows]] 常用的liunx命令windows移植
    - [[http://www.jianshu.com/p/aa19380828bd][配置豪华的 Windows 开发环境]]

* 第6周 标准库及其它
