README.html
<div id="outline-container-orgd43a90e" class="outline-3">
<h3 id="orgd43a90e"><span class="section-number-3">5.2</span> Python Koan项目</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Python Koan是通过TDD进行Python学习的一个项目，<a href="https://github.com/gregmalcolm/python_koans">项目地址</a>
请下载并按照文档设置，注意我们使用python2文件夹下的代码
</p>

<p>
每个题目都关于Python语言的一个特性，完成题目可以帮助掌握这个特性。
如遇到题目涉及到的教程中没有提及的概念，可以跳过。
<a href="https://github.com/sourabhv/python-koans-solutions/tree/master/python3/koans">Python Koan 答案参考</a> （注意此答案使用Python3版本）
</p>
</div>
</div>

<div id="outline-container-org3308d35" class="outline-3">
<h3 id="org3308d35"><span class="section-number-3">5.3</span> 阅读材料</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-orga919551" class="outline-4">
<h4 id="orga919551"><span class="section-number-4">5.3.1</span> 快速入门</h4>
<div class="outline-text-4" id="text-5-3-1">
<ul class="org-ul">
<li><a href="https://stephensugden.com/crash_into_python/">写给有经验程序员的Python入门教程</a> 快速了解Python特性</li>
<li><a href="https://dzone.com/refcardz/core-python">Python 核心特性</a> Section 1-11</li>
</ul>
</div>
</div>
<div id="outline-container-orgbe39e29" class="outline-4">
<h4 id="orgbe39e29"><span class="section-number-4">5.3.2</span> 请完成以下教程</h4>
<div class="outline-text-4" id="text-5-3-2">
<ul class="org-ul">
<li><a href="https://pymbook.readthedocs.io/en/py2/">Welcome to Python for you and me</a>  （比较简洁，PEP8 Guidelines，Virtualenv及之后章节可跳过)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgcf7adcf" class="outline-3">
<h3 id="orgcf7adcf"><span class="section-number-3">5.4</span> 编程练习 | 本周的Python Koan题目</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>about_asserts.py</li>
<li>about_strings.py</li>
<li>about_none.py</li>
<li>about_lists.py</li>
<li>about_list_assignments.py</li>
<li>about_dictionaries.py</li>
<li>about_string_manipulation.py</li>
<li>about_tuples.py</li>
<li>about_methods.py</li>
<li>about_control_statements.py</li>
<li>about_true_and_false.py</li>
<li>about_sets.py</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf73e5e4" class="outline-2">
<h2 id="orgf73e5e4"><span class="section-number-2">6</span> 第3周 继续Python Koan题目</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgb144352" class="outline-3">
<h3 id="orgb144352"><span class="section-number-3">6.1</span> 本周目标</h3>
</div>
<div id="outline-container-org51c2403" class="outline-3">
<h3 id="org51c2403"><span class="section-number-3">6.2</span> 阅读材料</h3>
<div class="outline-text-3" id="text-6-2">
</div><div id="outline-container-org0af1934" class="outline-4">
<h4 id="org0af1934"><span class="section-number-4">6.2.1</span> 请完成以下教程</h4>
<div class="outline-text-4" id="text-6-2-1">
<ul class="org-ul">
<li><a href="https://docs.python.org/2.7/tutorial/index.html">Python官方入门教程</a> (阅读2-9章节即可)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org79eab5e" class="outline-3">
<h3 id="org79eab5e"><span class="section-number-3">6.3</span> 编程练习 | 本周的Python Koan题目</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>about_triangle_project.py</li>
<li>about_exceptions.py</li>
<li>about_triangle_project2.py</li>
<li>about_iteration.py</li>
<li>about_comprehension.py</li>
<li>about_generators.py</li>
<li>about_lambdas.py</li>
<li>about_scoring_project.py</li>
<li>about_classes.py</li>
<li>about_new_style_classes.py</li>
<li>about_with_statements.py</li>
<li>about_monkey_patching.py</li>
<li>about_dice_project.py</li>
<li>about_method_bindings.py</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbb4f712" class="outline-2">
<h2 id="orgbb4f712"><span class="section-number-2">7</span> 第4周 decorator and context manager</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-org2dcb878" class="outline-3">
<h3 id="org2dcb878"><span class="section-number-3">7.1</span> 本周目标</h3>
<div class="outline-text-3" id="text-7-1">
<p>
相信大家对编程语言中的基于数据和基于函数的抽象都不陌生，现在来看一下Python对于基于语法的抽象的支持。
</p>
<ul class="org-ul">
<li>了解Python中装饰器(decorator)的概念</li>
<li>了解Python中上下文管理器(context manager)的概念</li>
</ul>
</div>
</div>

<div id="outline-container-orgede095c" class="outline-3">
<h3 id="orgede095c"><span class="section-number-3">7.2</span> 阅读材料</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li><a href="https://www.cnblogs.com/vamei/archive/2013/02/16/2820212.html">装饰器</a> 简短介绍</li>
<li><a href="https://www.thecodeship.com/patterns/guide-to-python-function-decorators/">A guide to Python's function decorators</a></li>
<li><a href="https://www.cnblogs.com/vamei/archive/2012/11/23/2772445.html">上下文管理器</a> 简短介绍</li>
<li><a href="http://arnavk.com/posts/python-context-managers/">Python in the real world: Context Managers</a></li>
</ul>
</div>
</div>

<div id="outline-container-org89762a5" class="outline-3">
<h3 id="org89762a5"><span class="section-number-3">7.3</span> 编程练习 | 本周的Python Koan题目</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>about_decorating_with_functions.py</li>
<li>about_decorating_with_classes.py</li>
<li>about_inheritance.py</li>
<li>about_multiple_inheritance.py</li>
<li>about_scope.py</li>
<li>about_modules.py</li>
<li>about_packages.py</li>
<li>about_class_attributes.py</li>
<li>about_attribute_access.py</li>
<li>about_deleting_objects.py</li>
<li>about_proxy_object_project.py</li>
<li>about_proxy_object_project.py</li>
<li>about_extra_credit.py</li>
<li>about_regex.py</li>
</ul>
</div>
</div>

<div id="outline-container-org1310e3f" class="outline-3">
<h3 id="org1310e3f"><span class="section-number-3">7.4</span> 扩展阅读</h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li><a href="https://pymotw.com/2/contextlib/">标准库中的context manager工具</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5fe7d92" class="outline-3">
<h3 id="org5fe7d92"><span class="section-number-3">7.5</span> 参考书目</h3>
<div class="outline-text-3" id="text-7-5">
<p>
学习了两个教程之后对Python语言已经有大致的了解，接下来如果需要深入学习，建议找一些严肃的书籍进行系统性的学习。
</p>
<ul class="org-ul">
<li><a href="http://fwww.pythonbooks.org">python books</a></li>
<li><a href="https://pythonguidecn.readthedocs.io/zh/latest/intro/learning.html">学习Python</a>资源</li>
<li><a href="https://www.fullstackpython.com/best-python-resources.html">Best Python Resources</a> Full Stack Python 本身也是很好的学习资源</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5d7a0f1" class="outline-2">
<h2 id="org5d7a0f1"><span class="section-number-2">8</span> 第5周 编程风格与命令行开发</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-org05f81f3" class="outline-3">
<h3 id="org05f81f3"><span class="section-number-3">8.1</span> 本周目标</h3>
<div class="outline-text-3" id="text-8-1">
<p>
了解Python编程风格及命令行开发工具.
</p>

<p>
Python code style 业界现在有两个标准，PEP8 以及 <a href="https://google.github.io/styleguide/pyguide.html">Google Python Style Guide</a>
项目组采用PEP8标准，对于Google Style可以稍作了解
</p>

<p>
除了日常在IDE里进行Python开发，开发人员也应该掌握一些在命令行环境下进行编程和debug的技能
</p>
</div>
</div>
<div id="outline-container-org4695bd4" class="outline-3">
<h3 id="org4695bd4"><span class="section-number-3">8.2</span> 阅读材料</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li><a href="https://pythonguidecn.readthedocs.io/zh/latest/writing/style.html">代码风格</a> <a href="http://docs.python-guide.org/en/latest/writing/style/">英文版</a></li>
<li><a href="https://pythonguidecn.readthedocs.io/zh/latest/dev/virtualenvs.html">虚拟环境</a> virtualenv</li>
<li><a href="https://pythonguidecn.readthedocs.io/zh/latest/dev/pip-virtualenv.html">Pip和Virtualenv的更多配置</a></li>
<li><a href="http://pep8.org/">PEP8</a> 建议阅读这个美化过的排版，<a href="https://www.python.org/dev/peps/pep-0008/">原版</a>地址</li>
<li><a href="https://github.com/google/yapf">yapf</a> Google 出品的自动化格式代码工具，建议了解一下</li>
</ul>
</div>
<div id="outline-container-org1d858c6" class="outline-4">
<h4 id="org1d858c6"><span class="section-number-4">8.2.1</span> ipython</h4>
<div class="outline-text-4" id="text-8-2-1">
<ul class="org-ul">
<li><a href="https://ipython.org/">官网</a></li>
<li><p>
作为一个交互式shell, 用来代替默认的python命令行编程环境
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #b2b2b2; font-style: italic;">&#20351;&#29992;&#20197;&#19979;&#21629;&#20196;&#23433;&#35013;python2.7&#29256;&#26412;&#30340;ipython</span>
pip install <span style="color: #ff1f8b;">'ipython&lt;=6.0.0'</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orge84cb2e" class="outline-4">
<h4 id="orge84cb2e"><span class="section-number-4">8.2.2</span> pdb</h4>
<div class="outline-text-4" id="text-8-2-2">
<p>
Python debuger, 交互式debug环境。类似于GDB
</p>
<ul class="org-ul">
<li><a href="https://pymotw.com/2/pdb/index.html">使用教程</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3da700b" class="outline-4">
<h4 id="org3da700b"><span class="section-number-4">8.2.3</span> vim</h4>
<div class="outline-text-4" id="text-8-2-3">
<p>
命令行环境下的编辑器
</p>
<ul class="org-ul">
<li><a href="http://www.openvim.com/">交互式的VIM简短教程</a> 十分炫酷的简短教程，掌握日常用到的最基本操作</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org324c1d0" class="outline-3">
<h3 id="org324c1d0"><span class="section-number-3">8.3</span> 编程练习</h3>
<div class="outline-text-3" id="text-8-3">
<p>
本周没有具体的编程练习，请花一点时间熟悉一下pip/virtualenv/ipython/pdb/vim工具。
</p>

<p>
编辑器/IDE是非常重要的工具，在工作过程中几乎所有的开发时间都花这上面，所以不
论你喜欢vim/emacs/vs code/atom/sublime text，你应该熟悉你的编程器/IDE。花些时间去了解
你喜欢的编程器/IDE
</p>

<p>
适当设置好开发环境对于提高开发效率也相当重要，有兴趣可以了解一下扩展阅读里列出的工具
</p>
</div>
</div>

<div id="outline-container-org40aa092" class="outline-3">
<h3 id="org40aa092"><span class="section-number-3">8.4</span> 扩展阅读</h3>
<div class="outline-text-3" id="text-8-4">
<ul class="org-ul">
<li><a href="https://pythonguidecn.readthedocs.io/zh/latest/dev/env.html">你的开发环境</a> <a href="http://docs.python-guide.org/en/latest/dev/env/">英文版</a></li>
<li><a href="https://aaaaaashu.gitbooks.io/mac-dev-setup/content/index.html">Mac 开发配置手册</a></li>
</ul>
</div>
<div id="outline-container-org17cbe29" class="outline-4">
<h4 id="org17cbe29"><span class="section-number-4">8.4.1</span> windows开发环境</h4>
<div class="outline-text-4" id="text-8-4-1">
<p>
个人推荐 Cygwin + ConEmu + zsh + oh-my-shell + CoreUtils
</p>
<ul class="org-ul">
<li><a href="https://cygwin.com/install.html">Cygwin</a></li>
<li><a href="https://conemu.github.io/">ConEmu</a></li>
<li><a href="http://www.jeffjade.com/2015/07/29/2015-07-29-mac-musthave-software/">终极Shell</a> 在Cygwin环境中也可以使用zsh + oh-my-zsh</li>
<li><a href="http://gnuwin32.sourceforge.net/packages/coreutils.htm">CoreUtils for Windows</a> 常用的liunx命令windows移植</li>
<li><a href="http://www.jianshu.com/p/aa19380828bd">配置豪华的 Windows 开发环境</a></li>
</ul>
</div>
</div>
</div>
</div>
