README.org
** 本周目标
   大概了解下Python标准库, 一些第三库/框架
** 阅读材料
*** 标准库
   - [[https://www.cnblogs.com/vamei/archive/2012/07/18/2597212.html][Python标准库——走马观花]]
   - [[https://www.cnblogs.com/vamei/archive/2012/08/31/2661870.html][Python标准库01 正则表达式 (re包)]]
   - [[https://www.cnblogs.com/vamei/archive/2012/09/05/2671198.html][Python标准库03 路径与文件 (os.path包, glob包)]]
   - [[https://www.cnblogs.com/vamei/archive/2012/09/14/2684775.html][Python标准库04 文件管理 (部分os包，shutil包)]]
   - [[https://www.cnblogs.com/vamei/archive/2012/09/23/2698014.html][Python标准库06 子进程 (subprocess包)]]
   - [[https://www.cnblogs.com/vamei/archive/2012/10/11/2720042.html][Python标准库08 多线程与同步 (threading包)]]
*** 常用库
**** Oslo
     Oslo 是由openstack项目衍生出来的一系列python库，为openstack众多项目提供统一的公共功能。
     #+BEGIN_QUOTE
     To produce a set of python libraries containing code shared by OpenStack
     projects. The APIs provided by these libraries should be high quality,
     stable, consistent, documented and generally applicable
     #+END_QUOTE
     - [[https://wiki.openstack.org/wiki/Oslo][官方Wiki Oslo库列表]]

     阅读使用和配置文档，大概了解这些包是用做什么的即可。
     - oslo.cache
     - oslo.concurrency
     - oslo.config
     - oslo.log
     - oslo.policy
     - pbr
**** SQLAlchemy
     SQLAlchemy 是一个连接数据库的ORM框架
     大概了解 SQLAlchemy 的简单使用方式，不要求深入了解
     - [[https://www.sqlalchemy.org/][官网]]
     - [[http://www.jianshu.com/p/e6bba189fcbd][简单介绍]]
     - [[http://www.liaoxuefeng.com/wiki/001374738125095c955c1e6d8bb493182103fac9270762a000/0014021031294178f993c85204e4d1b81ab032070641ce5000][简单使用教程]]

* 第7周 开源工具
** 本周目标
   了解一些开源工具及项目开发协作相关工具

   由于列出的工具较多，不要求深入了解
** 阅读材料
*** Markdown
    [[https://www.fullstackpython.com/markdown.html][Markdown语法]] 平时写文档时可以使用Markdown语法

    示例网站 https://maxiang.io/
    可以看到左边为文本内容，右边为渲染后的效果。使用markdown语法，书写文档时不需
    要关心排版效果，可以专注于内容本身。
*** Git && Gerrit
    项目组使用Git进行代码版本管理，使用Git是一项必备技能。如果以前没有使用Git的
    经验，请务必花一些时间学习。
    - [[https://github.com/larrycai/sdcamp/blob/master/contents/1-chapter2-git-gerrit.markdown][版本控制Git和代码审阅Gerrit]]
    - [[https://lvwzhen.gitbooks.io/git-tutorial/content/][Git教程]]
    - [[https://gerrit-review.googlesource.com/Documentation/intro-quick.html][Gerrit Code Review - A Quick Introduction]]
*** Jenkins && CI
    - [[https://gwpost.gitbooks.io/jenkins-the-definitive-guide/content/Introducting%20Jenkins/jie_shao.html][Jenkins与持续集成(CI)介绍]]
*** tox
    - [[http://wsfdl.com/python/2015/02/01/Python%E7%9A%84%E6%B5%8B%E8%AF%95%E4%B9%8BTox.html][Python 的单元测试之 tox]]
    - [[https://tox.readthedocs.io/en/latest/][tox官网介绍]]
*** 运维利器 Ansible
    自动化运维工具，可以稍作了解，日常工作中可能会用到ansible工具来批量运行脚本
    - [[http://www.stay-stupid.com/?p=366][Ansible 简介]] 阅读简介至ad-hoc部分即可
    - [[https://ansible-tran.readthedocs.io/en/latest/index.html][Ansible中文权威指南]]  如果有兴趣深入了解

* 第8周 实战
** 本周目标
   本周为编程练习，创建一个Python项目，并编程完成要求

   这个项目是完成一个命令行工具，可以通过命令行调用来完成数据库表的CUDR操作
** 编程练习
*** 申请虚拟机作为开发机，要求CentOS7.2系统
*** 配置pip文件
*** 安装并配置PostgreSQL数据库
    tips: 可以使用 NaviCat pgAdmin 等数据库管理工具

    配置数据库密码为 test123456

    创建database, 名称: cudr

    在 cudr 新建表，表名example

    创建 sql 如下
    #+BEGIN_SRC sql
    DROP TABLE IF EXISTS "public"."example";
    CREATE TABLE "public"."example" (
    "name" varchar(127) COLLATE "default" NOT NULL,
    "code" varchar(63) COLLATE "default" NOT NULL
    )
    WITH (OIDS=FALSE)
    ;
    ALTER TABLE "public"."example" ADD PRIMARY KEY ("name");
    #+END_SRC
*** 创建一个Python项目
    项目名称 cudr

    项目结构请阅读[[https://pythonguidecn.readthedocs.io/zh/latest/writing/structure.html][结构化你的工程]] 中仓库的结构一节，关于 Django Applications及之后的章节可跳过

    在 requirements.txt 文件中指定项目依赖库
    #+BEGIN_EXAMPLE
    sqlalchemy
    click
    #+END_EXAMPLE

    使用pip安装依赖
    #+BEGIN_SRC shell
    pip install -r requirements.txt
    #+END_SRC
**** click 用于创建命令行工具
     - [[http://click.pocoo.org/5/][官网]]
     - [[http://www.jianshu.com/p/d2b61a892c32][简单使用教程]]
**** sqlalchemy 数据库ORM工具
*** 编程
    在 cudr/core.py 中完成具体的代码工作

    具体代码实现以及命令行使用参数的设计可以自由发挥

    最终效果要求可以完成类似以下功能(不要求和下面示例代码中一样)
    - 创建
    - 读取
    - 修改
    - 删除
    #+BEGIN_SRC shell
    # 创建一个数据库记录
    python core.py --create name1 code1
    # 读取
    python core.py --read name1
    # 修改 指定主键name1及更新的字段及字段的新值
    python core.py --update name1 name=name2
    # 删除
    python core.py --delete name2
    #+END_SRC
