README.html

<div id="outline-container-org3833a1a" class="outline-2">
<h2 id="org3833a1a"><span class="section-number-2">9</span> 第6周 标准库及其它</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-orge2ad086" class="outline-3">
<h3 id="orge2ad086"><span class="section-number-3">9.1</span> 本周目标</h3>
<div class="outline-text-3" id="text-9-1">
<p>
大概了解下Python标准库, 一些第三库/框架
</p>
</div>
</div>
<div id="outline-container-orgf0cc333" class="outline-3">
<h3 id="orgf0cc333"><span class="section-number-3">9.2</span> 阅读材料</h3>
<div class="outline-text-3" id="text-9-2">
</div><div id="outline-container-org2fed6cd" class="outline-4">
<h4 id="org2fed6cd"><span class="section-number-4">9.2.1</span> 标准库</h4>
<div class="outline-text-4" id="text-9-2-1">
<ul class="org-ul">
<li><a href="https://www.cnblogs.com/vamei/archive/2012/07/18/2597212.html">Python标准库——走马观花</a></li>
<li><a href="https://www.cnblogs.com/vamei/archive/2012/08/31/2661870.html">Python标准库01 正则表达式 (re包)</a></li>
<li><a href="https://www.cnblogs.com/vamei/archive/2012/09/05/2671198.html">Python标准库03 路径与文件 (os.path包, glob包)</a></li>
<li><a href="https://www.cnblogs.com/vamei/archive/2012/09/14/2684775.html">Python标准库04 文件管理 (部分os包，shutil包)</a></li>
<li><a href="https://www.cnblogs.com/vamei/archive/2012/09/23/2698014.html">Python标准库06 子进程 (subprocess包)</a></li>
<li><a href="https://www.cnblogs.com/vamei/archive/2012/10/11/2720042.html">Python标准库08 多线程与同步 (threading包)</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3713540" class="outline-4">
<h4 id="org3713540"><span class="section-number-4">9.2.2</span> 常用库</h4>
<div class="outline-text-4" id="text-9-2-2">
</div><ol class="org-ol"><li><a id="orga96da64"></a>Oslo<br /><div class="outline-text-5" id="text-9-2-2-1">
<p>
Oslo 是由openstack项目衍生出来的一系列python库，为openstack众多项目提供统一的公共功能。
</p>
<blockquote>
<p>
To produce a set of python libraries containing code shared by OpenStack
projects. The APIs provided by these libraries should be high quality,
stable, consistent, documented and generally applicable
</p>
</blockquote>
<ul class="org-ul">
<li><a href="https://wiki.openstack.org/wiki/Oslo">官方Wiki Oslo库列表</a></li>
</ul>

<p>
阅读使用和配置文档，大概了解这些包是用做什么的即可。
</p>
<ul class="org-ul">
<li>oslo.cache</li>
<li>oslo.concurrency</li>
<li>oslo.config</li>
<li>oslo.log</li>
<li>oslo.policy</li>
<li>pbr</li>
</ul>
</div></li>
<li><a id="org5272cce"></a>SQLAlchemy<br /><div class="outline-text-5" id="text-9-2-2-2">
<p>
SQLAlchemy 是一个连接数据库的ORM框架
大概了解 SQLAlchemy 的简单使用方式，不要求深入了解
</p>
<ul class="org-ul">
<li><a href="https://www.sqlalchemy.org/">官网</a></li>
<li><a href="http://www.jianshu.com/p/e6bba189fcbd">简单介绍</a></li>
<li><a href="http://www.liaoxuefeng.com/wiki/001374738125095c955c1e6d8bb493182103fac9270762a000/0014021031294178f993c85204e4d1b81ab032070641ce5000">简单使用教程</a></li>
</ul>
</div></li></ol>
</div>
</div>
</div>

<div id="outline-container-org21851fa" class="outline-2">
<h2 id="org21851fa"><span class="section-number-2">10</span> 第7周 开源工具</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-orgc9d2fa5" class="outline-3">
<h3 id="orgc9d2fa5"><span class="section-number-3">10.1</span> 本周目标</h3>
<div class="outline-text-3" id="text-10-1">
<p>
了解一些开源工具及项目开发协作相关工具
</p>

<p>
由于列出的工具较多，不要求深入了解
</p>
</div>
</div>
<div id="outline-container-org38586fa" class="outline-3">
<h3 id="org38586fa"><span class="section-number-3">10.2</span> 阅读材料</h3>
<div class="outline-text-3" id="text-10-2">
</div><div id="outline-container-org0eb43e1" class="outline-4">
<h4 id="org0eb43e1"><span class="section-number-4">10.2.1</span> Markdown</h4>
<div class="outline-text-4" id="text-10-2-1">
<p>
<a href="https://www.fullstackpython.com/markdown.html">Markdown语法</a> 平时写文档时可以使用Markdown语法
</p>

<p>
示例网站 <a href="https://maxiang.io/">https://maxiang.io/</a>
可以看到左边为文本内容，右边为渲染后的效果。使用markdown语法，书写文档时不需
要关心排版效果，可以专注于内容本身。
</p>
</div>
</div>
<div id="outline-container-orge14818c" class="outline-4">
<h4 id="orge14818c"><span class="section-number-4">10.2.2</span> Git &amp;&amp; Gerrit</h4>
<div class="outline-text-4" id="text-10-2-2">
<p>
项目组使用Git进行代码版本管理，使用Git是一项必备技能。如果以前没有使用Git的
经验，请务必花一些时间学习。
</p>
<ul class="org-ul">
<li><a href="https://github.com/larrycai/sdcamp/blob/master/contents/1-chapter2-git-gerrit.markdown">版本控制Git和代码审阅Gerrit</a></li>
<li><a href="https://lvwzhen.gitbooks.io/git-tutorial/content/">Git教程</a></li>
<li><a href="https://gerrit-review.googlesource.com/Documentation/intro-quick.html">Gerrit Code Review - A Quick Introduction</a></li>
</ul>
</div>
</div>
<div id="outline-container-org80a3a06" class="outline-4">
<h4 id="org80a3a06"><span class="section-number-4">10.2.3</span> Jenkins &amp;&amp; CI</h4>
<div class="outline-text-4" id="text-10-2-3">
<ul class="org-ul">
<li><a href="https://gwpost.gitbooks.io/jenkins-the-definitive-guide/content/Introducting%20Jenkins/jie_shao.html">Jenkins与持续集成(CI)介绍</a></li>
</ul>
</div>
</div>
<div id="outline-container-org93c4449" class="outline-4">
<h4 id="org93c4449"><span class="section-number-4">10.2.4</span> tox</h4>
<div class="outline-text-4" id="text-10-2-4">
<ul class="org-ul">
<li><a href="http://wsfdl.com/python/2015/02/01/Python%E7%9A%84%E6%B5%8B%E8%AF%95%E4%B9%8BTox.html">Python 的单元测试之 tox</a></li>
<li><a href="https://tox.readthedocs.io/en/latest/">tox官网介绍</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb193356" class="outline-4">
<h4 id="orgb193356"><span class="section-number-4">10.2.5</span> 运维利器 Ansible</h4>
<div class="outline-text-4" id="text-10-2-5">
<p>
自动化运维工具，可以稍作了解，日常工作中可能会用到ansible工具来批量运行脚本
</p>
<ul class="org-ul">
<li><a href="http://www.stay-stupid.com/?p=366">Ansible 简介</a> 阅读简介至ad-hoc部分即可</li>
<li><a href="https://ansible-tran.readthedocs.io/en/latest/index.html">Ansible中文权威指南</a>  如果有兴趣深入了解</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb2bffff" class="outline-2">
<h2 id="orgb2bffff"><span class="section-number-2">11</span> 第8周 实战</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-org26d2c1f" class="outline-3">
<h3 id="org26d2c1f"><span class="section-number-3">11.1</span> 本周目标</h3>
<div class="outline-text-3" id="text-11-1">
<p>
本周为编程练习，创建一个Python项目，并编程完成要求
</p>

<p>
这个项目是完成一个命令行工具，可以通过命令行调用来完成数据库表的CUDR操作
</p>
</div>
</div>
<div id="outline-container-org03f7f6a" class="outline-3">
<h3 id="org03f7f6a"><span class="section-number-3">11.2</span> 编程练习</h3>
<div class="outline-text-3" id="text-11-2">
</div><div id="outline-container-orge28090b" class="outline-4">
<h4 id="orge28090b"><span class="section-number-4">11.2.1</span> 申请虚拟机作为开发机，要求CentOS7.2系统</h4>
</div>
<div id="outline-container-org3b1012b" class="outline-4">
<h4 id="org3b1012b"><span class="section-number-4">11.2.2</span> 配置pip文件</h4>
</div>
<div id="outline-container-org45e6d7f" class="outline-4">
<h4 id="org45e6d7f"><span class="section-number-4">11.2.3</span> 安装并配置PostgreSQL数据库</h4>
<div class="outline-text-4" id="text-11-2-3">
<p>
tips: 可以使用 NaviCat pgAdmin 等数据库管理工具
</p>

<p>
配置数据库密码为 test123456
</p>

<p>
创建database, 名称: cudr
</p>

<p>
在 cudr 新建表，表名example
</p>

<p>
创建 sql 如下
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #00af00;">DROP</span> <span style="color: #00af00;">TABLE</span> <span style="color: #ef2929;">IF</span> <span style="color: #00af00;">EXISTS</span> "<span style="color: #00af00;">public</span>"."example";
<span style="color: #00af00;">CREATE</span> <span style="color: #00af00;">TABLE</span> "<span style="color: #00af00;">public</span>"."example" <span style="color: #cc0000; font-weight: bold;">(</span>
"<span style="color: #00af00;">name</span>" <span style="color: #18b2b2;">varchar</span><span style="color: #1f5bff; font-weight: bold;">(</span><span style="color: #1f5bff;">127</span><span style="color: #1f5bff; font-weight: bold;">)</span> <span style="color: #00af00;">COLLATE</span> "<span style="color: #00af00;">default</span>" <span style="color: #00af00;">NOT</span> <span style="color: #00af00;">NULL</span>,
"code" <span style="color: #18b2b2;">varchar</span><span style="color: #1f5bff; font-weight: bold;">(</span><span style="color: #1f5bff;">63</span><span style="color: #1f5bff; font-weight: bold;">)</span> <span style="color: #00af00;">COLLATE</span> "<span style="color: #00af00;">default</span>" <span style="color: #00af00;">NOT</span> <span style="color: #00af00;">NULL</span>
<span style="color: #cc0000; font-weight: bold;">)</span>
<span style="color: #00af00;">WITH</span> <span style="color: #cc0000; font-weight: bold;">(</span>OIDS=<span style="color: #00af00;">FALSE</span><span style="color: #cc0000; font-weight: bold;">)</span>
;
<span style="color: #00af00;">ALTER</span> <span style="color: #00af00;">TABLE</span> "<span style="color: #00af00;">public</span>"."example" <span style="color: #00af00;">ADD</span> <span style="color: #00af00;">PRIMARY</span> <span style="color: #00af00;">KEY</span> <span style="color: #cc0000; font-weight: bold;">(</span>"<span style="color: #00af00;">name</span>"<span style="color: #cc0000; font-weight: bold;">)</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeb2af3d" class="outline-4">
<h4 id="orgeb2af3d"><span class="section-number-4">11.2.4</span> 创建一个Python项目</h4>
<div class="outline-text-4" id="text-11-2-4">
<p>
项目名称 cudr
</p>

<p>
项目结构请阅读<a href="https://pythonguidecn.readthedocs.io/zh/latest/writing/structure.html">结构化你的工程</a> 中仓库的结构一节，关于 Django Applications及之后的章节可跳过
</p>

<p>
在 requirements.txt 文件中指定项目依赖库
</p>
<pre class="example">
sqlalchemy
click
</pre>

<p>
使用pip安装依赖
</p>
<div class="org-src-container">
<pre class="src src-shell">pip install -r requirements.txt
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="orgb6287ea"></a>click 用于创建命令行工具<br /><div class="outline-text-5" id="text-11-2-4-1">
<ul class="org-ul">
<li><a href="http://click.pocoo.org/5/">官网</a></li>
<li><a href="http://www.jianshu.com/p/d2b61a892c32">简单使用教程</a></li>
</ul>
</div></li>
<li><a id="orge9e1c6b"></a>sqlalchemy 数据库ORM工具<br /></li></ol>
</div>
<div id="outline-container-org78b2b8b" class="outline-4">
<h4 id="org78b2b8b"><span class="section-number-4">11.2.5</span> 编程</h4>
<div class="outline-text-4" id="text-11-2-5">
<p>
在 cudr/core.py 中完成具体的代码工作
</p>

<p>
具体代码实现以及命令行使用参数的设计可以自由发挥
</p>

<p>
最终效果要求可以完成类似以下功能(不要求和下面示例代码中一样)
</p>
<ul class="org-ul">
<li>创建</li>
<li>读取</li>
<li>修改</li>
<li>删除</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #b2b2b2; font-style: italic;">&#21019;&#24314;&#19968;&#20010;&#25968;&#25454;&#24211;&#35760;&#24405;</span>
python core.py --create name1 code1
<span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #b2b2b2; font-style: italic;">&#35835;&#21462;</span>
python core.py --read name1
<span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #b2b2b2; font-style: italic;">&#20462;&#25913; &#25351;&#23450;&#20027;&#38190;name1&#21450;&#26356;&#26032;&#30340;&#23383;&#27573;&#21450;&#23383;&#27573;&#30340;&#26032;&#20540;</span>
python core.py --update name1 <span style="color: #ff8700;">name</span>=name2
<span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #b2b2b2; font-style: italic;">&#21024;&#38500;</span>
python core.py --delete name2
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Rnadll Wang</p>
<p class="date">Created: 2017-09-02 Sat 00:22</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
